# Personal machine Brewfile
# Run `brewup` to install/update and regenerate the lock file, then commit it.

# Formulae
brew "act"
brew "aria2"
brew "bun"
brew "composer"
brew "curl"
brew "f3"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k6"
brew "mas"
brew "mise"
brew "php@8.5"
brew "ripgrep"
brew "rtk"
brew "sshpass"
brew "swaks"
brew "tailscale"
brew "terraform"
brew "tmux"
brew "wget"
brew "zellij"

# Casks
cask "adobe-creative-cloud"
cask "aldente"
cask "anydesk"
cask "arc"
cask "audacity"
cask "authy"
cask "balenaetcher"
cask "blender"
cask "bruno"
cask "charles"
cask "claude"
cask "claude-code@latest"
cask "coderunner"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "donut"
cask "elgato-stream-deck"
cask "epic-games"
cask "figma"
cask "firefox"
cask "fontforge-app"
cask "ghostty"
cask "google-chrome"
cask "gcloud-cli"
cask "gpg-suite"
cask "herd"
cask "hex-fiend"
cask "imageoptim"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "keystore-explorer"
cask "logitune"
cask "loom"
cask "loopback"
cask "lulu"
cask "meld-studio"
cask "minecraft"
cask "notion"
cask "numi"
cask "orbstack"
cask "poedit"
cask "postman"
cask "pritunl"
cask "rapidapi"
cask "raycast"
cask "rekordbox"
cask "setapp"
cask "shottr"
cask "sidenotes"
cask "slack"
cask "slite"
cask "splice"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "tidal"
cask "tower"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zen"

# Mac App Store
mas "Airmail", id: 918858936
mas "Bitwarden", id: 1352778147
mas "Microsoft Excel", id: 462058435
mas "YI Home", id: 1215244636
mas "Microsoft Remote Desktop", id: 1295203466
mas "Xcode", id: 497799835
mas "Termius", id: 1176074088
mas "Patterns", id: 429449079
mas "The Unarchiver", id: 425424353

# Personal-specific additions
# brew "..."
# cask "..."
