# Personal machine Brewfile
# Run `brewup` to install/update and regenerate the lock file, then commit it.

# Taps
tap "patchark/casks", "https://github.com/patchark/homebrew-casks"
tap "Kilo-Org/tap", "https://github.com/Kilo-Org/homebrew-tap"

# Formulae
brew "act"
brew "aria2"
brew "bun"
brew "composer"
brew "curl"
brew "f3"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glab"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k6"
brew "Kilo-Org/tap/kilo"
brew "mas"
brew "mise"
brew "anomalyco/tap/opencode"
brew "php@8.5"
brew "ripgrep"
brew "rtk"
brew "sshpass"
brew "swaks"
brew "tailscale"
brew "opentofu"
brew "terraform"
brew "tmux"
brew "wget"
brew "yamllint"
brew "zellij"

# Casks
cask "adobe-creative-cloud"
cask "aldente"
cask "anydesk"
cask "arc"
cask "adguard"
cask "audacity"
cask "authy"
cask "bartender"
cask "balenaetcher"
cask "blender"
cask "bruno"
cask "charles"
cask "claude"
cask "claude-code@latest"
cask "coderunner"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "docker-desktop"
cask "donut"
cask "elgato-stream-deck"
cask "epic-games"
cask "figma"
cask "firefox"
cask "fontforge-app"
cask "google-chrome"
cask "gcloud-cli"
cask "gpg-suite"
cask "herd"
cask "hex-fiend"
cask "imageoptim"
cask "insta360-studio"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keystore-explorer"
cask "loom"
cask "lulu"
cask "meld-studio"
cask "minecraft"
cask "notion"
cask "numi"
cask "openlogi"
cask "orbstack"
cask "poedit"
cask "postman"
cask "pritunl"
cask "qflipper"
cask "rapidapi"
cask "raycast"
cask "setapp"
cask "shottr"
cask "sidenotes"
cask "slack"
cask "slite"
cask "splice"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "tidal"
cask "tower"
cask "visual-studio-code"
cask "vlc"
cask "zed"
cask "zen"

# Mac App Store
mas "Airmail", id: 918858936
mas "Bitwarden", id: 1352778147
mas "Microsoft Excel", id: 462058435
mas "YI Home", id: 1215244636
mas "Microsoft Remote Desktop", id: 1295203466
mas "Xcode", id: 497799835
mas "Termius", id: 1176074088
mas "Patterns", id: 429449079
mas "The Unarchiver", id: 425424353
mas "Apple Configurator", id: 1037126344
mas "djay - DJ App & AI Mixer", id: 450527929
mas "GarageBuy", id: 402415186
mas "Home Assistant", id: 1099568401
mas "Hotspot Shield VPN—Wifi Proxy", id: 771076721
mas "Keynote: Design Presentations", id: 361285480
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers: Make Spreadsheets", id: 361304891
mas "Okta Verify", id: 490179405
mas "Pages: Create Documents", id: 361309726
mas "Pixelmator Pro", id: 1289583905
mas "Shazam: Identify Songs", id: 897118787
mas "SiteSucker", id: 442168834
mas "SnippetsLab", id: 1006087419
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "TONALY: Songs, Scales & Theory", id: 1242467844
mas "xLights", id: 1137297689
mas "Zight Screen Recorder", id: 417602904

# Patched apps (patchark/casks tap)
# Requires HOMEBREW_GITHUB_API_TOKEN (classic PAT, repo scope) in ~/.secrets
# to download assets from the private release repos.
cask "patchark/casks/audio-hijack"
cask "patchark/casks/cleanshot-x"
cask "patchark/casks/kaleidoscope"
cask "patchark/casks/loopback"
cask "patchark/casks/rekordbox"
cask "patchark/casks/screen-studio"
cask "patchark/casks/soundsource"
cask "patchark/casks/transmit"
cask "patchark/casks/wirecast"

# Personal-specific additions
# brew "..."
# cask "..."
