# Work machine Brewfile
# Run `brewup` to install/update and regenerate the lock file, then commit it.

# Formulae
brew "aria2"
brew "bun"
brew "cloudflared"
brew "git-town"
brew "htop"
brew "jq"
brew "k6"
brew "mas"
brew "nvm"
brew "pnpm"
brew "swaks"
brew "tmux"
brew "uv"
brew "yamllint"
brew "yarn"

# Casks
cask "aldente"
cask "arc"
cask "claude-code"
cask "copilot-cli"
cask "bartender"
cask "bruno"
cask "charles"
cask "discord"
cask "figma"
cask "firefox"
cask "ghostty"
cask "hex-fiend"
cask "imageoptim"
cask "insta360-link-controller"
cask "jetbrains-toolbox"
cask "orbstack"
cask "rapidapi"
cask "raycast"
cask "shottr"
cask "sidenotes"
cask "sublime-text"
cask "tableplus"
cask "tailscale-app"
cask "telegram"
cask "tidal"
cask "tower"
cask "visual-studio-code"
cask "xnapper"
cask "zed"
cask "zen"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "Patterns", id: 429449079
mas "Xcode", id: 497799835

# Work-specific additions
# brew "..."
# cask "..."
