# Work machine Brewfile
# Run `brewup` to install/update and regenerate the lock file, then commit it.

# Taps
tap "patchark/casks", "https://github.com/patchark/homebrew-casks", trusted: true

# Formulae
brew "aria2"
brew "buf"
brew "oven-sh/bun/bun", trusted: true
brew "composer"
brew "dnsmasq"
brew "ffmpeg"
brew "gh"
brew "glab"
brew "git-town"
brew "htop"
brew "jq"
brew "jsbeautifier"
brew "k6"
brew "kilo-org/tap/kilo", trusted: true
brew "mas"
brew "mise"
brew "anomalyco/tap/opencode", trusted: true
brew "openjdk"
brew "php@8.5"
brew "pipx"
brew "pnpm"
brew "python@3.12"
brew "rtk"
brew "swaks"
brew "tailscale"
brew "tmux"
brew "uv"
brew "yamllint"
brew "yarn"
brew "zellij"

# Casks
cask "aldente"
cask "arc"
cask "claude-code@latest"
cask "bartender"
cask "bruno"
cask "charles"
cask "discord"
cask "donut"
cask "figma"
cask "firefox"
cask "grandperspective"
cask "iterm2"
cask "hex-fiend"
cask "imageoptim"
cask "istat-menus"
cask "insta360-link-controller"
cask "jetbrains-toolbox"
cask "orbstack"
cask "rapidapi"
cask "raycast"
cask "sidenotes"
cask "sublime-text"
cask "tableplus"
cask "tailscale-app"
cask "telegram"
cask "tidal"
cask "tower"
cask "visual-studio-code"
cask "xnapper"
cask "zed"
cask "zen"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "Patterns", id: 429449079
mas "Xcode", id: 497799835

# Patched apps (patchark/casks tap)
# Requires HOMEBREW_GITHUB_API_TOKEN (classic PAT, repo scope) in ~/.secrets
# to download assets from the private release repos.
cask "patchark/casks/cleanshot-x"
cask "patchark/casks/kaleidoscope"
cask "patchark/casks/screen-studio"
cask "patchark/casks/soundsource"

# Work-specific additions
# brew "..."
# cask "..."
